window.BOOK_META={
  lecturePdfPages:55,
  labPdfPages:120,

  lectures:[
    [1,'Дәріс №1. Объектіге бағытталған программалау технологиясы. С++ тілі'],
    [4,'Дәріс №2. Сілтемелер деректер типі'],
    [7,'Дәріс №3. Абстрактты тип ретіндегі класс'],
    [10,'Дәріс №4. Класс достары. Кластарға арналған стандартты операцияларды қайта жүктеу'],
    [13,'Дәріс №5. Үлгілер (шаблоны)'],
    [17,'Дәріс №6. Мұрагерлік'],
    [21,'Дәріс №7. Кластар иерархиясы'],
    [26,'Дәріс №8. Полиморфизм'],
    [29,'Дәріс №9. Абстрактылы кластар'],
    [32,'Дәріс №10. Әрекеттер аймақтары мен атаулар кеңістіктері'],
    [36,'Дәріс №11. Стандартты кітапхана құрылғыларымен С++ тіліндегі енгізу-шығару. Ағынды кластар'],
    [39,'Дәріс №12. Файлдық енгізу-шығару'],
    [43,'Дәріс №13. Ерекше жағдайларды өңдеу'],
    [47,'Дәріс №14. Динамикалық идентификациясы және типтерді келтіру'],
    [50,'Дәріс №15. С++ тілінің стандартты кітапханасы. Жалпыланған бағдарламалау']
  ],

  labs:[
    [1,'№1 зертханалық жұмыс','intro'],
    [11,'№2 зертханалық жұмыс','if'],
    [21,'№3 зертханалық жұмыс','if'],
    [31,'№4 зертханалық жұмыс','loop'],
    [41,'№5 зертханалық жұмыс','array'],
    [51,'№6 зертханалық жұмыс','function'],
    [61,'№7 зертханалық жұмыс','array'],
    [71,'№8 зертханалық жұмыс','function'],
    [81,'№9 зертханалық жұмыс','struct'],
    [91,'№10 зертханалық жұмыс','array'],
    [101,'№11 зертханалық жұмыс','struct'],
    [111,'№12 зертханалық жұмыс','graphics']
  ]
};